app/controllers/api/messages_controller.rb

  def create
    @message = current_user.messages.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("user_id", "stream_room_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["stream_room_id", 5], ["message", "whats up"], ["created_at", "2017-08-21 04:31:55.666896"], ["updated_at", "2017-08-21 04:31:55.666896"]]