app/controllers/api/stream_rooms_controller.rb

SELECT "stream_rooms".* FROM "stream_rooms"
---
  def index
    @stream_rooms = StreamRoom.all

SELECT  "stream_rooms".* FROM "stream_rooms" WHERE "stream_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @stream_room = StreamRoom.find(params[:id])

INSERT INTO "stream_rooms" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["name", "World of Warcraft"], ["created_at", "2017-08-20 19:56:26.438210"], ["updated_at", "2017-08-20 19:56:26.438210"]]
---
  def create
    @room = StreamRoom.new(stream_room_params)
    if @room.save!